---
title: PointOnEdgeFaceIntersection
classe: Autodesk.Revit.DB.PointOnEdgeFaceIntersection
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.PointElementReference
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# PointOnEdgeFaceIntersection

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean OrientWithEdge { get; set; }` | `pointOnEdgeFaceIntersection.OrientWithEdge` | Boolean |
| `Reference GetEdgeReference()` | `pointOnEdgeFaceIntersection.GetEdgeReference()` | Reference |
| `Reference GetFaceReference()` | `pointOnEdgeFaceIntersection.GetFaceReference()` | Reference |
| `Void SetEdgeReference(Reference)` | `pointOnEdgeFaceIntersection.SetEdgeReference(edgeReference)` | Void |
| `Void SetFaceReference(Reference)` | `pointOnEdgeFaceIntersection.SetFaceReference(reference)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```